ben/blog/2006-12-24-santas-dilemma.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Santas Dilemma</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Santas Dilemma</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/technology.html">technology</a></span></p>

<p>
Over the Christmas holiday I wrote a few posts for the Perl advent calendar. I'd like to share them here, if only for posterity. I believe you should be able to view the <a href="http://perladvent.pm.org/2006/24/">archived original</a>.
</p>

<p>
Perl Advent Calendar 2006-12-24
Santa's Dilemna
by Ben Prew
</p>

<p>
Kris Kringle had just left the North Pole on his brand-new state-of-the-art sleigh, complete with wireless access to the North Pole presents database. The elves had been hard at work bringing present distribution into the 21st century, and their finishing touch was getting rid of Santa's old, outdated hand-written list. The who-is-naughty, who-is-nice, and who-wants-what lists were now stored in a fancy new Oracle(!) database. (Yes, Oracle got off the naughty list with that one)
</p>

<p>
Everything was going swimmingly and Kris was picking, packing and delivering more presents then ever (Which is a good thing, considering our "conversion" program currently going on in Iraq). Unfortunately, just as he was sweeping into Russia, a black-bellied plover slammed into the side of the sleigh! Kris looked over the side and to his horror, a smoking hole was all that remained of his wireless link to the North Pole. A crackling on the radio brought Kris back to his senses. It was Rudolph, his main reindeer.
</p>

<p>
"Captain, what was that?"
</p>

<p>
"Rudy, we just got groused and lost our NP link."
</p>

<p>
"KGB?"
</p>

<p>
"Uhh&#x2026; I don't think so."
</p>

<p>
Rudolph was a huge conspiracy theory freak, and of course since they were over Russia, it could only be the KGB trying to sabotage Kris. They were trying to enact a "regime change", at least according to the reindeer.
</p>

<p>
Kris began rooting through his system, looking for a second chance&#x2026;
anything&#x2026;.
</p>

<p>
Any sort of land line connection&#x2026; no
Cell-phone card&#x2026; not even Verizon has that much coverage&#x2026;.
Tin-foil to make an improvised antenna from the reindeers antlers&#x2026;.
no
</p>

<p>
Wait, wait&#x2026; maybe this was something&#x2026;.
</p>

<p>
Kris realized that Norrish, his head elf, had been using his laptop to munge the wish list before importing it into the new database, and the raw text files were still sitting on his hard drive! Unfortunately, Kris didn't have time to install Oracle, much less the horsepower to run the database and import the data. He slumped back in his seat, slowly coming to terms with what this meant. Just as he was about to turn the sleigh around, Rudolph's nose lit up&#x2026;
</p>

<p>
"What is it boy, what are you thinking?"
</p>

<p>
Rudolph started wagging his tail excitedly (yes, reindeer have tails), and began jostling up and down, braying and making other reindeer noises.
</p>

<p>
"Come on Rudy, you know I can't understand you when you're this excited. Slow down, take a deep breath and try again"
</p>

<p>
Rudolph inhaled deeply, exhaled, and then quitely, calmly uttered four meager syllables,
</p>

<p>
"Any data?"
</p>

<p>
Kris stared at Rudolph blankly, not quite sure what to make of what was just said. What in the blazes did that mean? Out of ideas, but with little else to do over the vast Siberian wasteland, Kris focused all his Kringle energies and attempted to decode his companion's cryptic quip.
</p>

<p>
He scanned his memory, trying to dig up something, anything at all. Something nagged at the back of his mind, he could feel it, but he just couldn't mold it into a coherent thought. Suddenly, his eyes lit up, and quick as a wink Kris knew what Rudolph meant. The code began pouring from his fingers onto the screen as Kris entered the zone. His eyes narrowed as all other thoughts were put aside, as he intently focused on the task at hand.
</p>

<p>
"Where were those files&#x2026; in Norrish's home directory of course"
</p>

<p>
"Now, the sql queries"
</p>

<p>
With furious typing, a little elf magic and much unit testing (You know he rolls with XP), Kris had solved his problems and saved Christmas. Before you scroll down to the code, can you guess what characters his keyboard had expressed? What masterpiece he was able to piece together in a few short minutes, with only raw text files, and but a word from his most trusted reindeer? Behold, the code of Kris Kringle!
</p>

<p>
mod24.pl - Kringle's Code
</p>

<div class="org-src-container">
<pre class="src src-perl">#!/usr/bin/perl

use DBI;

# My files are laid out like this:
#
# presents.txt
# person_no|present
# 1|bicycle
# 1|action figure
# 2|doll
# 3|doll
# 4|bicycle
#
# people.txt
# person_no|name|personality|address
# 1|bob smith|nice|123 anywhere st, St. Petersburg
# 2|alice andrews|nice|465 somewhere st, Moscow
# 3|frank martonick|naughty|1138 lenin ave, St. Petersburg
# 4|billy cutter|nice|31337 peoples lane, Moscow

my $dbh = DBI-&gt;connect('dbi:AnyData(RaiseError=&gt;1):');

$dbh-&gt;func( 'people', 'Pipe', '/home/norrish/lists/people.txt',
            'ad_import');
$dbh-&gt;func( 'presents', 'Pipe', '/home/norrish/lists/presents.txt',
            'ad_import');

my $sth = $dbh-&gt;prepare(q/
SELECT person_no, name, address
FROM people
WHERE personality = ?/);

$sth-&gt;execute('nice');

while ( my $person = $sth-&gt;fetchrow_arrayref ) {
    my $presents = $dbh-&gt;selectall_arrayref(q/
SELECT present
FROM presents
WHERE person_no = ?/, {}, $person-&gt;[0]);

    print "Presents for ". $person-&gt;[1] . " (living at: ". $person-&gt;[2] .
        ")\n\t",
        join("\n\t", map { join " ", @$_ } @$presents), "\n\n";
}

$dbh-&gt;disconnect();

</pre>
</div>

<p>
DBD::AnyData is a Perl module that allows one to, among other things, use a variety of (mostly text) file formats as tables in a database. It seems to have limited support for joins, so I had to do the queries separately. Even so, AnyData is really cool!
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2006-12-24</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
